{
    "success": "result for api/fsm_descriptor/module/1",
    "data": 
    [{
        "flash_id": "stateTxt",
        "copy_en": "",
        "font": "NEXABOLD",
        "bold": false,
        "colour": "WHITE"
    }, 
    {
        "flash_id": "buttonFont",
        "copy_en": "",
        "font": "NEXALIGHT",
        "bold": false,
        "colour": "WHITE"
    }, 
    {
        "flash_id": "startAgain",
        "copy_en": "Start again",
        "font": "NEXABOLD",
        "bold": false,
        "colour": "GREY"
    }, 
    {
        "flash_id": "headerRight",
        "copy_en": "Pre diabetes - What you can do",
        "font": "NEXABOLD",
        "bold": false,
        "colour": "GREY"
    }, 
    
    {
        "flash_id": "findOutMore",
        "copy_en": "Find out more",
        "font": "NEXABOLD",
        "bold": false,
        "colour": "GREY"
    }, 

    {
        "flash_id": "share",
        "copy_en": "Share",
        "font": "NEXABOLD",
        "bold": false,
        "colour": "GREY"
    }, 

    {
        "flash_id": "legal",
        "copy_en": "Terms of use",
        "font": "NEXABOLD",
        "bold": false,
        "colour": "GREY"
    }, 

     {
        "flash_id": "page_findoutmore_title",
        "copy_en": "Find out more",
        "font": "NEXABOLD",
        "colour": "WHITE"
    }, 
      {
        "flash_id": "page_findoutmore_heading_1",
        "copy_en": "Want to find out more about pre diabetes and diabetes? \nHere are two great sites.",
        "font": "NEXABOLD",
        "colour": "WHITE"
    }, 

   
    {
        "flash_id": "page_findoutmore_copy_2",
        "copy_en": "For more about health and wellness - \n as well as what you can do about pre diabetes ( or managing your condition if you have diabetes ), please visit:",
        "font": "NEXALIGHT",
        "colour": "WHITE"
    },
    {
        "flash_id": "page_findoutmore_copy_3",
        "copy_en": "For even more information on diabetes \nand to find out how Diabetes New Zealand can help you, please visit:",
        "font": "NEXALIGHT",
        "colour": "WHITE"
    },


    {
        "flash_id": "footer_00_lslogo",
        "copy_en": "PREDIABETS",
        "font": "NEXALIGHT",
        "bold": false,
        "colour": "WHITE"
    },       
 
    {
        "flash_id": "footer_back_to_video",
        "copy_en": "BACK",
        "font": "NEXALIGHT",
        "bold": false,
        "colour": "GREY"
    },  
    {
        "flash_id": "full_screen_blocker",
        "copy_en": "Some parts of this experience require keyboard input. \nPlease click the allow button on screen now, or press Esc to continue.",
        "font": "NEXALIGHT",
        "colour": "LIGHT_GREY"
    },


    {
        "flash_id": "signup_facebook",
        "copy_en": "FACEBOOK",
        "font": "NEXALIGHT",
        "colour": "WHITE"
    }, {
        "flash_id": "signup_twitter",
        "copy_en": "TWITTER",
        "font": "NEXALIGHT",
        "colour": "WHITE"
    }, {
        "flash_id": "signup_google",
        "copy_en": "GOOGLE+",
        "font": "NEXALIGHT",
        "colour": "WHITE"
    },





     
    



     {
        "flash_id": "page_legal_title",
        "copy_en": "<h1>Pre diabetes interactive video terms and conditions of use</h1>",
        "font": "NEXABOLD",
        "colour": "WHITE"
    }, 
    {
        "flash_id": "page_legal_heading_1",
        "copy_en": "8 January 2014",
        "font": "NEXABOLD",
        "colour": "WHITE"
    }, 
    {
        "flash_id": "page_legal_content_1",
        "copy_en": "The following terms and conditions govern your use of this website service. By using this website and interactive application, you agree to be bound by these terms and conditions.\n \nPlease read this agreement carefully before accessing or using the service. \n \nTHIS WEBSITE AND INTERACTIVE APPLICATION DOES NOT PROVIDE MEDICAL ADVICE.  It is intended for information only. We make no recommendations on its applicability to any particular clinical situation. It is not a substitute for professional medical advice, diagnosis or treatment. If you think you may have a medical emergency call Emergency 111 immediately. For personal advice please talk with your healthcare professional. ",
        "font": "NEXALIGHT",
        "colour": "WHITE"
    }, 
    {
        "flash_id": "page_legal_heading_2",
        "copy_en": "General terms and conditions",
        "font": "NEXABOLD",
        "colour": "WHITE"
    }, 
    {
        "flash_id": "page_legal_content_2",
        "copy_en": "By accessing this web and mobile-based application you agree to be bound by these terms of use. Your access and use of this site and its services bind you to this agreement. If you do not agree to the terms and conditions of use for this site, you may not use the site or its services.\n \nWe may modify this agreement at any time. Any modifications made to this agreement will be effective immediately upon posting on the site. By accessing or using the service, you agree to be bound by all of the terms and conditions of the agreement as posted on the service at the time of your access or use. You agree to review the agreement posted on the service each time you use the service so that you are aware of any modifications made to this agreement.",
        "font": "NEXALIGHT",
        "colour": "WHITE"
    }, 
    {
        "flash_id": "page_legal_heading_3",
        "copy_en": "Our liability",
        "font": "NEXABOLD",
        "colour": "WHITE"
    }, 
    {
        "flash_id": "page_legal_content_3",
        "copy_en": "Whilst we endeavour to ensure that information on this website is correct, we cannot guarantee and assume no legal liability or responsibility for the accuracy, currency or completeness of the information available through this website. The information on this website is for personal use only and is provided in good faith. Users who link to another site from this site are subject to the liability policy of the new site.",
        "font": "NEXALIGHT",
        "colour": "WHITE"
    }, 
    {
        "flash_id": "page_legal_heading_4",
        "copy_en": "External websites",
        "font": "NEXABOLD",
        "colour": "WHITE"
    }, 
    {
        "flash_id": "page_legal_content_4",
        "copy_en": "Where the website contains links to third party resources on the web. We do not endorse, approve or sanction (unless otherwise stated) nor are we responsible for any third party's products, services, acts or omissions.\n \nIt is the responsibility of the user to make their own decisions about the accuracy, currency, reliability and correctness of information contained in any linked external web sites. You will be responsible for your use of any external website.\n \nThis site gives access to external websites Facebook and Twitter. We make no warranties representations or undertakings nor accept any liability or responsibility in connection with the content or use made of any website linked to this website. You must comply with any of the terms and conditions of Facebook and Twitter. You will be responsible for anything which happens on any of your accounts.",
        "font": "NEXALIGHT",
        "colour": "WHITE"
    }, 

    {
        "flash_id": "page_legal_heading_5",
        "copy_en": "Copyright",
        "font": "NEXABOLD",
        "colour": "WHITE"
    },
    {
        "flash_id": "page_legal_content_5",
        "copy_en": "The materials on the site are copyrighted by us and/or other applicable rights holders. All design, text and graphics displayed are copyrighted. None of the contents may be copied or incorporated into any other website or other work of any kind, in any form whatsoever.\n \nThe service is for your own personal, non-commercial use only. You may not otherwise reproduce, copy, distribute or use any material on this website. Permanent copying and/or storage of material or reproduction or incorporation of any part of it in any other work, in whatever media, is expressly prohibited. Any other use of the materials is strictly prohibited without our prior written permission and the permission of the applicable rights holder(s).\n \nYou agree not to hack or reverse engineer, or acquire unauthorised access to, any part of the site, or attempt to do any of the foregoing.",
        "font": "NEXALIGHT",
        "colour": "WHITE"
    }, 


    {
        "flash_id": "page_legal_heading_6",
        "copy_en": "Service delivery",
        "font": "NEXABOLD",
        "colour": "WHITE"
    }, 
    {
        "flash_id": "page_legal_content_6",
        "copy_en": "We cannot guarantee that the delivery of this website service will be fault free. If a fault occurs in the service we will attempt to correct the fault as soon as we reasonably can. Your access to the website may be occasionally restricted to allow for repairs or maintenance.\n \nTo the maximum extent permitted by law, we do not warrant or make any representations as to the security of this site. Nor warrant that the site or the servers which make this site available or electronic communications are free from viruses or any other harmful element.",
        "font": "NEXALIGHT",
        "colour": "WHITE"
    }, 
    {
        "flash_id": "page_legal_heading_7",
        "copy_en": "Privacy",
        "font": "NEXABOLD",
        "colour": "WHITE"
    },
    {
        "flash_id": "page_legal_content_7",
        "copy_en": "We treat your privacy seriously and we understand that you would wish to know how we shall use the information we collect from your use of these website services.\n \nWhere you voluntarily provide personal information (e.g. through login, online forms or email requests), we will hold your personal information in accordance with the Privacy Act 1993.\n \nThe Privacy Act 1993 regulates us through the Information Privacy Principles as to how we collect, use, hold, disclose, access, correct, manage and dispose of your personal information.\n \nPrivacy Act 1993 - http://www.privacy.org.nz/privacy-act/",
        "font": "NEXALIGHT",
        "colour": "WHITE"
    }, 
    {
        "flash_id": "page_legal_heading_8",
        "copy_en": "Cookies",
        "font": "NEXABOLD",
        "colour": "WHITE"
    },
    {
        "flash_id": "page_legal_content_8",
        "copy_en": "This website service requires users to have cookies enabled. Cookies are small computer files which our site will store in your internet browser, which enable information to be transmitted to and from your internet browser and our site. These are temporary cookies rather than permanent ones, which means that these cookies are deleted or made inactive when you close your internet browser. No critical or sensitive information is stored by cookies and our cookies cannot be used to identify you as an individual. We use temporary cookies to improve the sites accessibility. By using the site, you agree to our use of cookies as described above.",
        "font": "NEXALIGHT",
        "colour": "WHITE"
    }, 
    {
        "flash_id": "page_legal_heading_9",
        "copy_en": "IP addresses",
        "font": "NEXABOLD",
        "colour": "WHITE"
    },
    {
        "flash_id": "page_legal_content_9",
        "copy_en": "We collect and log the Internet Protocol address (IP) of all visitors to this site. An IP address is a number automatically assigned to your computer whenever you access the Internet. IP addresses allow computers and servers to recognise and communicate with one another. We collect IP address information so that we can properly administer our system and gather aggregate information about how our site is being used. This aggregate information may be shared with third parties. To maintain your anonymity, we do not associate IP addresses with records containing personal information. We will use IP address information, however, to personally identify you in order to enforce our legal rights or when required to do so by law enforcement authorities.\n \nInformation that is automatically retrieved about your visit includes -\n<li>your IP address</li>\n<li>the pages you accessed on the website and the links you clicked on</li>\n<li>the date and time you visited the website</li>\n<li>the referring website (if any) through which you clicked through to this website</li>\n<li>your operating system (e.g. Windows XP, Mac OSX)</li>\n<li>the type of web browser you use (e.g. Internet Explorer, Mozilla Firefox)</li>\n<li>other incidental matters such as screen resolution, the release of your installed Flash version and the language setting of your browser.\n \n Your information is collected and stored on servers which are owned and maintained by or on our behalf. The site has a Secure Socket Layer (SSL) certificate (a means of keeping information secure).</li>",
        "font": "NEXALIGHT",
        "colour": "WHITE"
    }, 



    {
        "flash_id": "page_legal_heading_10",
        "copy_en": "How we collect and use personal information",
        "font": "NEXABOLD",
        "colour": "WHITE"
    },
    {
        "flash_id": "page_legal_content_10",
        "copy_en": "Through this website we will collect information that can identify you, such as your name, e-mail address, and other similar information when it is voluntarily submitted to us. We will use your information to respond to requests you may make of us; and from time to time, we may refer to your information to better understand your needs and how we can improve our services. We will only keep your information for as long as it is necessary to achieve the purpose for which it was collected, or to comply with our legal obligations.",
        "font": "NEXALIGHT",
        "colour": "WHITE"
    }, 

    {
        "flash_id": "page_legal_heading_11",
        "copy_en": "What we provide to third parties",
        "font": "NEXABOLD",
        "colour": "WHITE"
    },
    {
        "flash_id": "page_legal_content_11",
        "copy_en": "We may share your personally identifiable information with third parties who we have engaged to help us provide the services. In each case, we will ensure that these third parties have agreed not to use or disclose your personal information except to help us provide the services.\n \nExcept as noted above, we do not provide any third party access to your IP address and email address.\n \nWe may provide third parties with aggregate statistics about our visitors, traffic patterns and related site information. These data reflect site-usage patterns gathered during visits to our website each month, but they do not contain identifying information about any individual member unless that member has given us permission to share that information.",
        "font": "NEXALIGHT",
        "colour": "WHITE"
    }, 
    {
        "flash_id": "page_legal_heading_12",
        "copy_en": "Provision of the service",
        "font": "NEXABOLD",
        "colour": "WHITE"
    },
    {
        "flash_id": "page_legal_content_12",
        "copy_en": "This website service and interactive application is provided by HealthMentor Online Limited, P O Box 9973, Newmarket, Auckland 1149, New Zealand.\n \n To view any personal information held by us, or if you have any concerns about personal information that we hold, please write to: The Privacy Officer, HealthMentor Online Limited, P O Box 9973, Newmarket, Auckland 1149, New Zealand.",
        "font": "NEXALIGHT",
        "colour": "WHITE"
    }, 

    {
        "flash_id": "page_legal_heading_13",
        "copy_en": "New Zealand Law",
        "font": "NEXABOLD",
        "colour": "WHITE"
    },
    {
        "flash_id": "page_legal_content_13",
        "copy_en": "These terms and conditions and any disputes arising from or in connection with them shall be governed by the laws of New Zealand and the parties submit to the exclusive jurisdiction of New Zealand.\n \n \n",
        "font": "NEXALIGHT",
        "colour": "WHITE"
    }, 




    {
        "flash_id": "page_share_title",
        "copy_en": "Please share this with your friends",
        "font": "NEXABOLD",
        "colour": "WHITE"
    }, 


    {
        "flash_id": "page_overweight_title",
        "copy_en": "Are you overweight? Here's a rough guide.",
        "font": "NEXABOLD",
        "colour": "WHITE"
    }, 

    {
        "flash_id": "page_overweight_heading_1",
        "copy_en": "",
        "font": "NEXABOLD",
        "colour": "WHITE"
    }, 
    {
        "flash_id": "page_overweight_content_1",
        "copy_en": "Let’s say you're 1.5m tall (4ft 11in) tall.\n If you weigh 56kg (8 stone 11lb) or more, then you’re seen as 'overweight'.\n \nIf you're taller than that, the weight at which you start to be seen as “overweight” is as follows... \n \n1.6m (5ft 3in)       - 64kg (10 stone 1lbs)\n1.7m (5ft 7in)       - 72kg (11 stone 5lbs)\n1.8m (5ft 10in)      - 81kg (12 stone 10lbs)\n1.9m (6ft 3in)       - 90kg (14 stone 2lbs)\n \nDon’t know your height or weight? Another way to look at it is like this:",
        "font": "NEXALIGHT",
        "colour": "WHITE"
    }, 
    {
        "flash_id": "page_overweight_heading_2",
        "copy_en": "How big is your waist size?",
        "font": "NEXABOLD",
        "colour": "WHITE"
    }, 
    {
        "flash_id": "page_overweight_content_2",
        "copy_en": "For most people, you’re probably overweight:\n If you’re a man with a waist size over 102cm (40 inches)\n If you’re a woman with a waist size over 88cm (34.5 inches)\n \nFor people of Asian descent, you’re probably overweight: \nIf you’re a man with a waist size over 90cm (35.5 inches)\n If you’re a woman with a waist size over 80cm (31.5 inches) ",
        "font": "NEXALIGHT",
        "colour": "WHITE"
    }


   ]
}